# Tính tiền thuê phòng
x=int(input('Nhập loại phòng(từ 1-8) :'))
y=int(input('Nhập số đêm :'))
if y==1:
    if x==1:
        T=1260000*y
    elif x==2:
        T=1550000*y
    elif x==3:
        T=1830000*y
    elif x==4:
        T=1830000*y
    elif x==5:
        T=2120000*y
    elif x==6:
        T=2120000*y
    elif x==7:
        T=2540000*y
    else:
        T=4800000*y
    print("Thành tiền :",T)
if 2<=y<=3:
    if x==1:
        T=(1260000-(1260000*0.25))*y
    elif x==2:
        T=(1550000-(1550000*0.25))*y
    elif x==3:
        T=(1830000-(1830000*0.25))*y
    elif x==4:
        T=(1830000-(1830000*0.25))*y
    elif x==5:
        T=(2120000-(2120000*0.25))*y
    elif x==6:
        T=(2120000-(2120000*0.25))*y
    elif x==7:
        T=(2540000-(2540000*0.25))*y
    else:
        T=(4800000-(4800000*0.25))*y
    print("Thành tiền :",T)    
if y>=4:
    if x==1:
        T=(1260000-(1260000*0.3))*y
    elif x==2:
        T=(1550000-(1550000*0.3))*y
    elif x==3:
        T=(1830000-(1830000*0.3))*y
    elif x==4:
        T=(1830000-(1830000*0.3))*y
    elif x==5:
        T=(2120000-(2120000*0.3))*y
    elif x==6:
        T=(2120000-(2120000*0.3))*y
    elif x==7:
        T=(2540000-(2540000*0.3))*y
    else:
        T=(4800000-(4800000*0.3))*y
    print("Thành tiền :",T)        


                                    

